Revit 2027 API
Schema.Lookup Method
 Finds the Schema corresponding to the GUID in memory.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Schema Lookup(
	Guid guid
)
Public Shared Function Lookup (
	guid As Guid
) As Schema
public:
static Schema^ Lookup(
	Guid guid
)
static member Lookup :
        guid : Guid -> Schema
Parameters
guid Guid
Return Value
Schema
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace